Revit 2027 API
MEPCurveType.PreferredJunctionType Property
The preferred junction type of the MEP curve type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public JunctionType PreferredJunctionType { get; set; }
Public Property PreferredJunctionType As JunctionType
	Get
	Set
public:
property JunctionType PreferredJunctionType {
	JunctionType get ();
	void set (JunctionType value);
}
member PreferredJunctionType : JunctionType with get, set
Property Value
JunctionType
Remarks
Use RoutingPreferenceManager to set this property for PipeType MEPCurves.
See Also
Reference
MEPCurveType Class
Autodesk.Revit.DB Namespace